performance/tests/pre-cadastro.yaml
config:
  target: "http://localhost:3333/api"
  payload:
    path: "../data/usuarios.csv"
    fields:
      - "name"
      - "email"
      - "password"
    order: "sequence"
    skipHeader: true
  phases:
    - name: "carga-usuarios"
      duration: 100
      arrivalRate: 1

  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Cadastro em Massa via CSV"
    flow:
      - post:
          url: "/auth/register"
          json:
            name: "{{ name }}"
            email: "{{ email }}"
            password: "{{ password }}"
          expect:
            - statusCode: 201
            - hasProperty: "user"
            - match:
                json: "$.message"
                value: "Usuário cadastrado com sucesso!"